app/views/likes/_likes.html.erb

<% if post.liked_by?(current_user) %>
  <%= link_to post.likes.count, post_like_path(post, post.like_by(current_user)), method: :delete, remote: true, class: "fas fa-heart heart_red", style:"color: red"%>
<% else %>
  <%= link_to post.likes.count, post_likes_path(post), method: :post, remote: true, class: "fas fa-heart heart_blue" %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
SELECT "posts".* FROM "posts"