app/controllers/posts_controller.rb

  def create
    @post= Post.new(post_params)
    @post.user_id = current_user.id
    @post.save!
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "video") VALUES (?, ?, ?, ?)  [["caption", "aaa"], ["created_at", "2021-11-17 08:01:15.441100"], ["updated_at", "2021-11-17 08:01:15.441100"], ["video", "pexels-german-korb-5644053.mp4"]]