app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.id == current_user.id
      @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "12051.jpg"], ["updated_at", "2021-11-17 13:06:56.649566"], ["id", 1]]

  def unsubscribe
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def withdraw
    @user = User.find(params[:id])
    @user.update(is_valid: false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_valid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_valid", 1], ["updated_at", "2021-11-10 15:20:23.045509"], ["id", 1]]