app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)
    @video.save
---
INSERT INTO "videos" ("title", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "affas"], ["caption", "saas"], ["created_at", "2021-11-07 15:50:05.804353"], ["updated_at", "2021-11-07 15:50:05.804353"]]